Revit 2024 API
AdvancedLossFactor Constructor
Overload List
Name | Description
AdvancedLossFactor()
 Creates an advanced loss factor object with values set to no loss.
AdvancedLossFactor(AdvancedLossFactor)
 Creates a copy of the given advanced loss factor object
AdvancedLossFactor(Double, Double, Double, Double, Double, Double, Double)
 Creates an advanced loss factor object with the given values.
See Also
AdvancedLossFactor Class
AdvancedLossFactor Members
Autodesk.Revit.DB.Lighting Namespace